In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
l = ["ali","saleh","khaled"]
x = pd.Series(l,index=[1,2,3])
x

1       ali
2     saleh
3    khaled
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
x.index=[11, 12, 13]
x

11       ali
12     saleh
13    khaled
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
print(x[:2])

11      ali
12    saleh
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
z=pd.Series(x.values)
x= pd.concat([x,z])
print(x)
x=x.drop_duplicates()
print(x)

11       ali
12     saleh
13    khaled
0        ali
1      saleh
2     khaled
dtype: object
11       ali
12     saleh
13    khaled
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [16]:
Students  = pd.DataFrame(columns=["ID", "Name", "GPA"])
Students

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [8]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [14]:
edu.loc[50:60, ['TIME', 'GEO']]

    TIME                       GEO
50  2002  Euro area (17 countries)
51  2003  Euro area (17 countries)
52  2004  Euro area (17 countries)
53  2005  Euro area (17 countries)
54  2006  Euro area (17 countries)
55  2007  Euro area (17 countries)
56  2008  Euro area (17 countries)
57  2009  Euro area (17 countries)
58  2010  Euro area (17 countries)
59  2011  Euro area (17 countries)
60  2000  Euro area (15 countries)

In [15]:
edu[50:60]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
50,2002,Euro area (17 countries),Total public expenditure on education as % of ...,4.86,e
51,2003,Euro area (17 countries),Total public expenditure on education as % of ...,4.89,e
52,2004,Euro area (17 countries),Total public expenditure on education as % of ...,4.80,e
53,2005,Euro area (17 countries),Total public expenditure on education as % of ...,4.72,e
54,2006,Euro area (17 countries),Total public expenditure on education as % of ...,4.69,e
55,2007,Euro area (17 countries),Total public expenditure on education as % of ...,4.79,e
56,2008,Euro area (17 countries),Total public expenditure on education as % of ...,4.94,e
57,2009,Euro area (17 countries),Total public expenditure on education as % of ...,5.31,e
58,2010,Euro area (17 countries),Total public expenditure on education as % of ...,5.28,e
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e